## Question 1: **Answer**

In [1]:
import sqlite3

In [2]:
def add_data_to_database():
    try:
        # Connect to the database (or create one if it doesn't exist)
        with sqlite3.connect("sales_data.db") as conn:
            cursor = conn.cursor()
            # Create the sales table
            cursor.execute('''
            CREATE TABLE IF NOT EXISTS sales (
                id INTEGER PRIMARY KEY,
                first_name TEXT,
                sales INTEGER,
                year INTEGER
            )
            ''')
            # Insert data into the sales table
            data = [
                (1, 'John', 1000, 2001),
                (2, 'Mary', 1500, 2002),
                (3, 'John', 2000, 2002),
                (4, 'Alice', 1800, 2003),
                (5, 'Mary', 2200, 2003),
                (6, 'Bob', 1700, 2001)
            ]
            cursor.executemany(
                '''
                INSERT INTO sales (id, first_name, sales, year)
                VALUES (?, ?, ?, ?)
                ''', data
            )
            conn.commit()
    except Exception as e:
        print(f"Error: {e}")
    finally:
        conn.close()

# Calling the function
add_data_to_database()

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///sales_data.db

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [6]:
%%sql
SELECT * FROM sales;

 * sqlite:///sales_data.db
Done.

[(1, 'John', 1000, 2001),
 (2, 'Mary', 1500, 2002),
 (3, 'John', 2000, 2002),
 (4, 'Alice', 1800, 2003),
 (5, 'Mary', 2200, 2003),
 (6, 'Bob', 1700, 2001)]

In [7]:
%%sql
SELECT * FROM sales
WHERE year = 2001;

 * sqlite:///sales_data.db
Done.

[(1, 'John', 1000, 2001), (6, 'Bob', 1700, 2001)]

2.	## Question 2: **Answer**

In [8]:
%%sql
SELECT
    sales AS sales_by_john
FROM sales
WHERE first_name = 'John';

 * sqlite:///sales_data.db
Done.

[(1000,), (2000,)]

## Question 3: **Answer**

In [9]:
%%sql
SELECT
    first_name,
    sales
FROM sales
WHERE first_name = 'John' AND year = 2002;

 * sqlite:///sales_data.db
Done.

[('John', 2000)]

## Question 4: **`Answer`**

In [10]:
%%sql
SELECT DISTINCT first_name FROM sales
WHERE year = 2002 OR year = 2003;

 * sqlite:///sales_data.db
Done.

[('Mary',), ('John',), ('Alice',)]

## Altenative solution

In [11]:
%%sql
SELECT DISTINCT first_name
FROM sales WHERE year IN (2002, 2003);

 * sqlite:///sales_data.db
Done.

[('Mary',), ('John',), ('Alice',)]

## Question 5: **Answer**

In [12]:
%%sql
SELECT * FROM sales
WHERE first_name = 'Mary'AND year IN (2002, 2003);

 * sqlite:///sales_data.db
Done.

[(2, 'Mary', 1500, 2002), (5, 'Mary', 2200, 2003)]

## Question 6: **Answer**

In [13]:
%%sql
SELECT * FROM sales
WHERE first_name NOT IN ('Mary', 'John')

 * sqlite:///sales_data.db
Done.

[(4, 'Alice', 1800, 2003), (6, 'Bob', 1700, 2001)]

In [14]:
# %%sql
# DROP TABLE IF EXISTS sales;